In [1]:
import numpy as np
import pandas as pd

In [2]:
ipl_data = {'Team':['MI','DL','MI','DL','Kings','CSK','CSK','CSK','MI','RR','RR','MI'],
           'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
           'Year':[2014,2015,2014,2015,2016,2015,2016,2017,2016,2014,2015,2017],
           'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [3]:
df = pd.DataFrame(ipl_data)
df

     Team  Rank  Year  Points
0      MI     1  2014     876
1      DL     2  2015     789
2      MI     2  2014     863
3      DL     3  2015     673
4   Kings     3  2016     741
5     CSK     4  2015     812
6     CSK     1  2016     756
7     CSK     1  2017     788
8      MI     2  2016     694
9      RR     4  2014     701
10     RR     1  2015     804
11     MI     2  2017     690

In [4]:
# typecast above: to get a output
list(df.groupby('Team'))

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('DL',
    Team  Rank  Year  Points
  1   DL     2  2015     789
  3   DL     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2016     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  2    MI     2  2014     863
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('RR',
     Team  Rank  Year  Points
  9    RR     4  2014     701
  10   RR     1  2015     804)]

In [5]:
tm = df.groupby('Team')
tm

In [9]:
# Fetch data of only MI
for team,data in tm:
    if team == 'MI':
        print(data)

   Team  Rank  Year  Points
0    MI     1  2014     876
2    MI     2  2014     863
8    MI     2  2016     694
11   MI     2  2017     690

In [12]:
k = df.groupby('Team').groups # it gives team name index wise(where it is present)
k

{'CSK': [5, 6, 7], 'DL': [1, 3], 'Kings': [4], 'MI': [0, 2, 8, 11], 'RR': [9, 10]}

In [14]:
print('Welcome to IPL Search')
print('Select your team from below:')
print(k.keys())
tem = input('Enter Your Team:')
ind = k[tem]
df.loc[ind,:]

Welcome to IPL Search
Select your team from below:
dict_keys(['CSK', 'DL', 'Kings', 'MI', 'RR'])
Enter Your Team:MI

   Team  Rank  Year  Points
0    MI     1  2014     876
2    MI     2  2014     863
8    MI     2  2016     694
11   MI     2  2017     690

In [15]:
list(df.groupby(['Team','Year']))

[(('CSK', 2015),
    Team  Rank  Year  Points
  5  CSK     4  2015     812),
 (('CSK', 2016),
    Team  Rank  Year  Points
  6  CSK     1  2016     756),
 (('CSK', 2017),
    Team  Rank  Year  Points
  7  CSK     1  2017     788),
 (('DL', 2015),
    Team  Rank  Year  Points
  1   DL     2  2015     789
  3   DL     3  2015     673),
 (('Kings', 2016),
      Team  Rank  Year  Points
  4  Kings     3  2016     741),
 (('MI', 2014),
    Team  Rank  Year  Points
  0   MI     1  2014     876
  2   MI     2  2014     863),
 (('MI', 2016),
    Team  Rank  Year  Points
  8   MI     2  2016     694),
 (('MI', 2017),
     Team  Rank  Year  Points
  11   MI     2  2017     690),
 (('RR', 2014),
    Team  Rank  Year  Points
  9   RR     4  2014     701),
 (('RR', 2015),
     Team  Rank  Year  Points
  10   RR     1  2015     804)]

In [ ]:
# Fetch data only teams with rank 1

In [ ]:
# take sum of all points yearwise

In [ ]:
# i want record of year 2017

In [ ]:
# multiple column groupby

In [ ]:
# i want the team who stood 1st max times in ipl